package A06_Interface.Feature;

public class Demo {
    /*
        接口的成员特点：

            1.成员变量：只能定义常量，因为系统会默认加入三个关键字
                public static final

            2.成员方法：只能定义抽象方法，因为系统会默认加入两个关键字
                public abstract

            3.构造方法：没有

-------------------------------------------------------------------

        接口和类之间的各种关系：
        
            1.类和类之间：继承关系，只支持单继承，不支持多继承，但是可以多层继承

            2.类和接口之间：实现关系，可以单实现，也可以多实现，甚至可以在继承一个类的同时，实现多个接口

            3.接口和接口之间：继承关系，可以单继承，也可以多继承

     */
    public static void main(String[] args) {

    }
}
