package A11_Regex.Basic;

public class Demo {

    /*
        正则表达式 : 本质来说是一个字符串,可以指定一些规则, 来校验其它字符串
     */

    //1. 字符类
        /*

        [] : 代表单个字符

        -----------------------------------------------------------
            [abc]            只能是a, b或c
            [^abc]           除了a, b, c之外的任何字符
            [a-zA-Z]         a到z, A到Z, 包括(范围)
            [a-d[m-p]]       a到d, 或m到p : ([a-dm-p]更直观)
            [a-z&&[def]]     d, e或f (交集) (等同于[def])
            [a-z&&[^bc]]     a到z,除了b和c : (等同于[ad-z]  减法)
            [a-z&&[^m-p]]    a到z, 除了m到p : (等同于[a-lq-z]  减法)
        -----------------------------------------------------------
         */

    //2. 预定义字符类
        /*

        \ : 转义字符

        -----------------------------------------------------------
            .                任何字符
            \d               一个数字 : [0-9]
            \D               非数字 : [^0-9]
            \s               一个空白字符 : [ \t\n\x0B\f\人\]
            \S               非空白字符 : [^\s]
            \w               [a-zA-Z_0-9]   英文\数字\下划线
            \W               [^\w]   一个非单词字符
        -----------------------------------------------------------
         */

    //3. 数量
        /*
        -----------------------------------------------------------
        X?                   X, 一次或0次
        X*                   X, 零次或多次(任意次数)
        X+                   X, 一次或多次
        X{n}                 X, 正好n次
        X{n, }               X, 至少n次
        X{n,m}               X, 至少n但是不超过m次
        -----------------------------------------------------------
         */
    public static void main(String[] args) {

        String regex = "\\d";
        System.out.println("5".matches(regex));


    }
}
